# -*- coding: utf-8 -*-
from __future__ import print_function

agents_data_list = [
    """
    Data structure to store agents and products that contain them.
    Used to validate user input during agents searching
    """
    u"пшеница",
    u"житен",
    u"житно",
    u"ечемик",
    u"ръж",
    u"ръжен",
    u"овес",
    u"овесен",
    u"ориз",
    u"оризов",
    u"шпелта",
    u"соя",
    u"соев",
    u"царевица",
    u"царевичен",

    u"портокал",
    u"грейпфрут",
    u"лимон",
    u"ананас",
    u"мандарина",
    u"авокадо",
    u"киви",
    u"банан",

    u"омар",
    u"скарида",
    u"скариди",
    u"раци",
    u"рак",
    u"морски език",

    u"кокоше яйце",
    u"падпадъче яйце",
    u"яйце",
    u"яйца",
    u"жълтък",
    u"жълтъци",
    u"белтък",
    u"белтъци",

    u"риба",
    u"рибен",
    u"пъстърва",
    u"змиьорка",
    u"камбала",
    u"сьомга",
    u"триска",
    u"риба тон",
    u"херинга",

    u"ябълка"
    u"ябълков",
    u"круша",
    u"ягода",
    u"ягодов",
    u"малина",
    u"капина",
    u"праскова",
    u"грозде",
    u"гроздов",

    u"свинско",
    u"свински",
    u"пилешко",
    u"пилешки",
    u"телешко",
    u"телешки",
    u"говеждо",
    u"говежда",
    u"пуешко",
    u"пуешки",
    u"агнешко",
    u"агнешка",
    u"агне",

    u"Мляко",
    u"заквасена сметана",
    u"сирена",
    u"извара",
    u"кашкавал",
    u"масло",
    u"сирене",
    u"сладкарска сметана",

    u"фастъци",
    u"фастък",
    u"бадеми",
    u"бразилски орех",
    u"кашу",
    u"лешници",
    u"лешника",
    u"макадамия",
    u"орех",
    u"шамфастък",

    u"сусам",
    u"сусамово масло",

    u"соя",
    u"соев сос",

    u"чесън",
    u"кориандър",
    u"червен пипер",
    u"черен пипер",
    u"ванилия",
    u"канела",
    u"анасон",

    u"черен чай",
    u"напитки от хмел",
    u"хмел",
    u"какао",
    u"кафе",
    u"бира",

    u"грах",
    u"морков",
    u"картоф",
    u"картофи",
    u"карфиол",
    u"целина",
    u"аспержи",
    u"спанак",
    u"домати",
    u"доматен сос",
    u"доматено пюре",
    u"лук",

]


def to_string_list(agents_data):
    agents = []
    for agent in agents_data:
        agents.append(agent.encode("utf-8"))
    return agents

